app/controllers/api/v1/categories_controller.rb

SELECT `categories`.* FROM `categories`
INSERT INTO `categories` (`title`, `category_id`, `created_at`, `updated_at`, `user_id`) VALUES ('テスト', 1, '2018-11-28 12:34:18', '2018-11-28 12:34:18', 1111)
INSERT INTO `work_times` (`time`, `times_category_id`, `created_at`, `updated_at`, `user_id`) VALUES ('98', 2, '2018-11-28 12:38:16', '2018-11-28 12:38:16', 1111)
INSERT INTO `categories` (`title`, `category_id`, `created_at`, `updated_at`, `user_id`) VALUES ('カキクケコ', 4, '2018-11-28 13:45:55', '2018-11-28 13:45:55', 1111)
---
    def create
      category = Category.new(category_params)
      unless Category.search_title(category.title, cookies[:user_id]).blank?
        render json: { message: '同じカテゴリが存在します', status: 400 }
        return
      end
      category.created_at = Time.current
      category.updated_at = Time.current
      category.user_id = cookies[:user_id]
      category.save!

SELECT  `categories`.* FROM `categories` ORDER BY `categories`.`id` DESC LIMIT 1
---
    def create_first_category
      if Category.search_category(cookies[:user_id]).blank?