app/controllers/api/v1/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
    def show
      @categories = Category.all