app/controllers/api/v1/show_graph_controller.rb

SELECT `work_times`.* FROM `work_times` WHERE `work_times`.`user_id` = 1111 AND `work_times`.`created_at` = '2018-11-29 16:21:27'
---
    def select_work_time
      user_id = 1111
      params[:id] == "1" ? work_times = WorkTime.where("user_id = #{user_id} and created_at like '2018-11%'") : work_times = 'NG'