app/controllers/api/v1/show_graph_controller.rb

    def calctime(user_id)
      category_id = []
      work_times = {}

      params[:day].present? ? work_dates = WorkTime.where("user_id = #{user_id} and created_at like '2018-#{change_time_notation(params[:month])}-#{change_time_notation(params[:day])}%'") : work_dates = WorkTime.where("user_id = #{user_id} and created_at like '2018-#{change_time_notation(params[:month])}%'")

      work_dates.each do |work_date|
        category_id.include?(work_date['category_id']) ?  category_id << work_date['category_id'] : category_id << work_date['category_id']
        category_name = Category.find("#{work_date['category_id']}")
        category_id.include?(work_date['category_id']) ? work_times["#{category_name['title']}"] = work_times["#{category_name['title']}"].to_f + work_date['time'].to_f : work_times["#{category_name['title']}"] = work_date['time'].to_f
---
SELECT `work_times`.* FROM `work_times` WHERE (user_id = 1111 and created_at like '2018-01-01%')
SELECT `work_times`.* FROM `work_times` WHERE (user_id = 1111 and created_at like '2018-01-07%')
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 19 LIMIT 1
SELECT `work_times`.* FROM `work_times` WHERE (user_id = 1111 and created_at like '2018-11%')

    def calctime_category(user_id)
      work_times = {}

      params[:day].present? ? work_dates = WorkTime.where("user_id = #{user_id} and category_id = #{params[:category_id]} and created_at like '2018-#{change_time_notation(params[:month])}-#{change_time_notation(params[:day])}%'") : work_dates = WorkTime.where("user_id = #{user_id} and category_id = #{params[:category_id]} and created_at like '2018-#{change_time_notation(params[:month])}%'")

      work_dates.each do |work_date|
        category_name = Category.find("#{work_date['category_id']}")
---
SELECT `work_times`.* FROM `work_times` WHERE (user_id = 1111 and category_id = null and created_at like '2018-0null-0null%')
SELECT `work_times`.* FROM `work_times` WHERE (user_id = 1111 and created_at like '2018-1%-undefined')
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 19 LIMIT 1