app/controllers/api/v1/work_times_controller.rb

    def index
      @work_times = WorkTime.all
---
SELECT `work_times`.`time`, `work_times`.`created_at` FROM `work_times`

    def show
      @work_times = WorkTime.all
---
SELECT `work_times`.* FROM `work_times`

    def create
      work_times = WorkTime.new(work_time_params)
      work_times.time = calctime()
      work_times.category_id = params[:work_time][:work_time]
      work_times.created_at = Time.current
      work_times.updated_at = Time.current
      work_times.user_id = 1111
      work_times.save!
---
INSERT INTO `work_times` (`time`, `times_category_id`, `created_at`, `updated_at`, `user_id`) VALUES ('2.0h', 13, '2018-11-28 15:08:53', '2018-11-28 15:08:53', 1111)